tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"


# specify a directory to install
cask_args appdir: '/Applications'
brew 'openssh'

# unix things
brew 'readline'
brew 'tmux'

# services
brew 'mysql'
brew 'mysql-client'
brew 'postgres'

# RVM requirements
brew 'autoconf'
brew 'automake'
brew 'libtool'
brew 'pkg-config'
brew 'coreutils'
brew 'libksba'
brew 'zlib'

# Rails requirements
brew 'gmp'
brew 'libyaml'
brew 'libxml2'
brew 'mysql-connector-c++'
brew 'llvm'
brew 'shared-mime-info'

# TED devops stuff
# brew tap tedconf/chewbacca git@github.com:tedconf/homebrew-chewbacca.git
# brew install tedconf/chewbacca/dhip
#
cask 'gpg-suite'
brew 'gnupg'
brew 'pinentry-mac'

# JavaScript
brew 'yarn'

# needed for ERD diag
brew 'graphviz'

# aws utlities
brew 'awscli'

# unix utils I like
brew 'tree'
brew 'rg'
brew 'bat'
brew 'gh'
brew 'fd'

# Mac Desktop apps
cask 'tableplus'
cask 'devutils'
cask 'iterm2'
cask "insomnia"
cask "slack"
cask "visual-studio-code"

# Stuff
brew "tree"
brew "wget"
